export interface TreeData {
  [key: string]: TreeData[];
}

export const data: TreeData[] = [
  {
    'تحقيقات موظفي الهيئة': [
      { '1 أمير': [] },
      { '2 شحود': [] },
      { '3 مصطفى': [] },
    ],
  },
  {
    'تحقيقات المخلصين الجمركيين': [
      { '1 ناسكا': [] },
      {
        '2 ايبلا': [
          { '21 منصة': [] },
          { '22 قطر': [] },
          {
            '23 العقارية': [
              { '231 الجمارك': [] },
              {
                '232 القطرية': [
                  { '2321 الكويت': [] },
                  { '2322 قطر': [] },
                  { '2323 سوريا': [] },
                ],
              },
              { '233 مصر': [] },
            ],
          },
        ],
      },
      {
        '3 أمير': [{ '31 شحود': [] }, { '32 مصطفى': [] }, { '33 أمير': [] }],
      },
    ],
  },
];
